## <font color='#F7CAC9'>Pandas</font>

In [2]:
import pandas as pd
import numpy as np

Series

In [3]:
s1 = pd.Series([1,2,-5,0])

In [4]:
s1

0    1
1    2
2   -5
3    0
dtype: int64

In [5]:
s1.values

array([ 1,  2, -5,  0], dtype=int64)

In [6]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
s2 = pd.Series([1,2,-5,0], index = ['a','b','c','d'])

In [8]:
s2

a    1
b    2
c   -5
d    0
dtype: int64

In [9]:
s2['a'] = 1000

In [10]:
s2

a    1000
b       2
c      -5
d       0
dtype: int64

#### <font color = '#F7CAC9'>Comparação</font>

In [11]:
s2[s2>0]

a    1000
b       2
dtype: int64

#### <font color = '#F7CAC9'> Algebra </font>

In [12]:
s2*2

a    2000
b       4
c     -10
d       0
dtype: int64

In [13]:
s2

a    1000
b       2
c      -5
d       0
dtype: int64

In [14]:
s2.isnull()

a    False
b    False
c    False
d    False
dtype: bool

#### <font color = '#F7CAC9'> Dataframe </font>

In [17]:
dd = {'estado':['SP', 'MG', 'PR', 'SP', 'MG', 'PR'], 'ano':[2019, 2019, 2019, 2020, 2020, 2020], 'pop':[45.9, 21.9, 16.9, 46.6, 21.4, 17.3]}
df1 = pd.DataFrame(dd)

In [18]:
df1

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.9
2     PR  2019  16.9
3     SP  2020  46.6
4     MG  2020  21.4
5     PR  2020  17.3

In [20]:
df1.head(2)

  estado   ano   pop
0     SP  2019  45.9
1     MG  2019  21.9

In [21]:
df1.tail(2)

  estado   ano   pop
4     MG  2020  21.4
5     PR  2020  17.3

In [22]:
df1.sample(2)

  estado   ano   pop
2     PR  2019  16.9
5     PR  2020  17.3

#### <font color = '#F7CAC9'> DataFrame a partir do anterior </font>

In [23]:
df2 = pd.DataFrame(dd, columns=['ano', 'estado', 'pop'])

In [24]:
df2

    ano estado   pop
0  2019     SP  45.9
1  2019     MG  21.9
2  2019     PR  16.9
3  2020     SP  46.6
4  2020     MG  21.4
5  2020     PR  17.3

#### <font color = '#F7CAC9'> Observar DataFrame  </font>

In [26]:
df2['estado']

0    SP
1    MG
2    PR
3    SP
4    MG
5    PR
Name: estado, dtype: object

In [27]:
df2.ano

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

In [28]:
df2.dtypes

ano         int64
estado     object
pop       float64
dtype: object

#### <font color = '#F7CAC9'>Atribuir valores </font>

In [33]:
df2['estimativa'] = 50

In [34]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9          50
1  2019     MG  21.9          50
2  2019     PR  16.9          50
3  2020     SP  46.6          50
4  2020     MG  21.4          50
5  2020     PR  17.3          50

In [36]:
df2['estimativa'] = np.arange(6)

In [37]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.9           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

In [38]:
df3 = df2

In [39]:
df3

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.9           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

In [40]:
df3 = df2['ano']

In [41]:
df3

0    2019
1    2019
2    2019
3    2020
4    2020
5    2020
Name: ano, dtype: int64

In [42]:
df2['Não Paraná'] = df2.estado!='PR'

In [44]:
df2

    ano estado   pop  estimativa  Não Paraná
0  2019     SP  45.9           0        True
1  2019     MG  21.9           1        True
2  2019     PR  16.9           2       False
3  2020     SP  46.6           3        True
4  2020     MG  21.4           4        True
5  2020     PR  17.3           5       False

#### <font color = '#F7CAC9'> Excluir coluna </font>

In [45]:
del df2['Não Paraná']

In [46]:
df2

    ano estado   pop  estimativa
0  2019     SP  45.9           0
1  2019     MG  21.9           1
2  2019     PR  16.9           2
3  2020     SP  46.6           3
4  2020     MG  21.4           4
5  2020     PR  17.3           5

#### <font color = '#F7CAC9'> Entender o DataFrame </font>

In [47]:
df2.shape

(6, 4)

In [48]:
df2.shape[0]

6

In [49]:
df2.index

RangeIndex(start=0, stop=6, step=1)

In [50]:
df2.columns

Index(['ano', 'estado', 'pop', 'estimativa'], dtype='object')

In [52]:
df2.count()

ano           6
estado        6
pop           6
estimativa    6
dtype: int64

#### <font color = '#F7CAC9'> Alterar informações da coluna </font>

In [53]:
df2.columns = ['Ano', 'estado', 'População', 'estimativa']

In [54]:
df2

    Ano estado  População  estimativa
0  2019     SP       45.9           0
1  2019     MG       21.9           1
2  2019     PR       16.9           2
3  2020     SP       46.6           3
4  2020     MG       21.4           4
5  2020     PR       17.3           5

#### <font color = '#F7CAC9'> Analisar DataFrame </font>

In [55]:
df2.describe(include='all')

                Ano estado  População  estimativa
count      6.000000      6   6.000000    6.000000
unique          NaN      3        NaN         NaN
top             NaN     SP        NaN         NaN
freq            NaN      2        NaN         NaN
mean    2019.500000    NaN  28.333333    2.500000
std        0.547723    NaN  14.029778    1.870829
min     2019.000000    NaN  16.900000    0.000000
25%     2019.000000    NaN  18.325000    1.250000
50%     2019.500000    NaN  21.650000    2.500000
75%     2020.000000    NaN  39.900000    3.750000
max     2020.000000    NaN  46.600000    5.000000

#### <font color = '#F7CAC9'> Alterar valores e consultar dados </font>

In [56]:
df2['Ano'] = df2['Ano'] + 2

In [57]:
df2

    Ano estado  População  estimativa
0  2021     SP       45.9           0
1  2021     MG       21.9           1
2  2021     PR       16.9           2
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

In [58]:
df2[df2['Ano']>2021]

    Ano estado  População  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

In [59]:
df4 = df2[df2['Ano']>2021]

In [60]:
df4

    Ano estado  População  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

#### <font color = '#F7CAC9'> Excluir Colunas </font>

In [61]:
df4.drop('Ano', axis='columns')

  estado  População  estimativa
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [62]:
df4

    Ano estado  População  estimativa
3  2022     SP       46.6           3
4  2022     MG       21.4           4
5  2022     PR       17.3           5

In [64]:
df2.drop('Ano', axis='columns', inplace=True)

In [65]:
df2

  estado  População  estimativa
0     SP       45.9           0
1     MG       21.9           1
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

#### <font color = '#F7CAC9'> Excluir linhas </font>

In [66]:
df2.drop([0,1])

  estado  População  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [ ]:
df2.drop([0,1], inplace=True)

  estado  População  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5

In [ ]:
dflinhas = df2
dflinhas.drop([0,1], inplace=True)

#### <font color = '#F7CAC9'> Ver dados de linhas </font>

In [71]:
df2.iloc[0]

estado          PR
População     16.9
estimativa       2
Name: 2, dtype: object

In [72]:
df2.iloc[1:3]

  estado  População  estimativa
3     SP       46.6           3
4     MG       21.4           4

In [73]:
df2.iloc[1:3,[1,2]]

   População  estimativa
3       46.6           3
4       21.4           4

In [74]:
df2

  estado  População  estimativa
2     PR       16.9           2
3     SP       46.6           3
4     MG       21.4           4
5     PR       17.3           5